Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/skills_training_linked_to_government_agencies.html.txt.tmx
Source language: en
Languages: ga

source: Skills training linked to national development
ga: Scileanna traenála náscaithe le comhlucht náisiúnta

source: If you are interested in a career related to fisheries, food, hospitality, tourism, farming, forestry or crafts, you may find the course you are looking for amongst those offered by Government-funded agencies that specialise in that area
ga: Má tá suim agat i slí beatha a bhaineann le iascaireacht, bia, fáiltíocht, turasóireacht, feirmeoireacht, foraoiseacht, nó céardaíocht, d'fheadfá an cúrsa atá á lorg agat a fháil i measc na gcúrsaí atá ar fáil ag eagraíochtaí maoinithe Rialtais seachas FÁS

source: Each of the agencies described below is directly linked to a particular commercial or industrial sector and has a range of state-funded full-time and part-time vocational courses on offer
ga: Tá gach ceann de na heagraíochtaí atá liostáilte thíos ceangailte go díreach le rannóg áirithe tionsclaíochta nó tráchtála agus tá réimse de chúrsaí gairmeacha lánaimseartha agus páirtaimseartha á reachtáil acu

source: You need to check out each individual course with regard to details such as entry requirements and training allowances as they can be very different
ga: Caithfidh tú gach cúrsa a sheiceáil i dtaobh mioneolas maidir le riachtanais iontrála agus liúntas traenála mar is féidir leis na cúrsaí a bheith an-difriúil óna chéile

source: Some agencies, for example, offer training courses at third level
ga: Tairiscíonn cuid de na heagraíochtaí, mar shampla, cúrsaí traenála ag an triú leibhéal

source: These particular courses require you to have formal qualifications and to apply through the Central Applications Office as you would for any other third-level course
ga: Caithfidh tú cáilíochtaí fhoirmiúla a bheith agat do na cúrsaí seo agus d'iarratas a dhéanamh tríd an Lár Oifig Iarratais mar an gcéanna is a dhéanfá le aon chúrsa triú leibhéal eile

source: Courses are offered by the following organisations:
ga: Cúrsaí curtha ar fáil ag:

source: Fáilte Ireland is the National Tourism Development Authority of the island of Ireland
ga: Is é Fáilte Éireann an tÚdarás Náisiúnta um Fhorbairt Turasóireachta

source: It is responsible for supporting the development of the Irish tourism industry
ga: Tá sé freagrach as tacaíocht a thabhairt d’fhorbairt an tionscail turasóireachta in Éirinn

source: If you are interested in developing your skills in the tourism and hospitality sector, you can find the range of courses on the Fáilte Ireland website
ga: Má tá spéis agat do scileanna san earnáil turasóireachta agus lóndadóireachta a fhorbairt, is féidir an réimse cursaí Fáilte Éireann ar líne a fheiceáil

source: Teagasc is Ireland's National Agriculture and Food Development Authority
ga: Is é Teagasc an tÚdarás Náisiúnta Talmhaíochta agus Forbartha Bia

source: It provides a range of services, which include advice, research, education and training, to the agricultural and food industries
ga: Cuireann sé réimse seirbhísí ar fáil, ina measc comhairle, taighde, oideachas agus traenáil, chuig tionscail na talmhaíochta agus an bhia

source: It provides third-level and vocational courses for young people in the areas of agriculture, horticulture, forestry, equine studies and many more
ga: Cuireann Teagasc cúrsaí tríú leibhéil agus gairmiúla ar fáil do dhaoine óga atá ag dul le gairmeacha sa talmhaíocht, garraíodóireacht, fhoraoiseacht, staidéar eachaí agus níos mó

source: It provides adult farmer courses in financial management, environment and options outside of mainstream farming and also has training programmes for food industry personnel in food safety, quality, process and product development
ga: agus deiseanna do theaghlaigh feirme, agus roghanna lasmuigh den fheirmeoireacht príomhshrutha. Soláthraíonn Teagasc traenáil do dhaoine atá ag obair i dtionscal an bhia maidir le sábháilteacht bhia, caighdeáin, próiseáil agus forbairt táirge

source: You can view the range of Teagasc courses online
ga: Is féidir an réimse cursaí Teagasc ar líne a fheiceáil

source: Coillte is the agency in Ireland responsible for managing state forests and any related commercial activities
ga: Tá bainistíocht choillte an Stáit faoi chúramCoillte chomh maith le aon ghnóthaí eacnamaíochta a bhaineann leo

source: Coillte works closely with those involved in timber production and provides services in Ireland in the areas of forestry, landscape and arboriculture
ga: Bíonn Coillte ag obair as láimh a chéile le daoine a bhfuil baint acu le táirgeadh adhmaid agus cuireann an t-eagras seo seirbhísí foraoise, tírdhreacha agus crannadóireachta ar fáil

source: It is also involved in training, research engineering, forest nurseries, Christmas tree farms and the development of leisure facilities
ga: Tá baint ag Coillte le traenáil, le hinnealtóireacht taighde, plandlanna crann, feirmeacha crainnte Nollag agus áiseanna siamsaíochta a fhorbairt chomh maith

source: Coillte training services provide a range of forestry industry training courses
ga: Soláthraíonn na seirbhísí traenála de chuid Coillte réimse cursaí traenála i dtionscal na foraoise

source: Bord Iascaigh Mhara (The Irish Sea Fisheries Board) is the state agency for the development of the sea fishing and aquaculture industries
ga: Is é Bord Iascaigh Mhara an ghníomhaireacht stáit i gcomhair fhorbairt thionscail na hiascaireachta mara agus an uisce-shaothraithe

source: If you are unemployed and interested in education and training in the fishing or aquaculture industry or if you are already working in these industries and would like to upgrade your skills, you may find a course to suit you among those offered by Bord Iascaigh Mhara. The courses include training in catching, fish farming (aquaculture) and seafood processing
ga: Má bhíonn tú dífhostaithe agus go mbíonn suim agat san oideachas agus san oiliúint i dtionscal na n-iascach nó i dtionscal an uisceshaothraithe, nó go bhfuil tú ag obair sna tionscail sin cheana féin agus gur mhaith leat feabhas a chur le do scileanna, b'fhéidir go dtiocfá ar chúrsa feiliúnach duit i measc na gceann a thairgíonn Bord Iascaigh Mhara san áireamh: iascach, feirmeoireacht éisc (uisce-shaothrú), próiseáil an bhia mhara

source: The Crafts Council of Ireland
ga: Comhairle Cheardaíochta na hÉireann

source: The Crafts Council of Ireland (CCoI) is the national organisation for the development of the craft industry in Ireland
ga: Is í Comhairle Cheardaíochta na hÉireann (CCnÉ) an ghníomhaireacht náisiúnta in Éirinn do fhorbairt thionscal na ceardaíochtaí

source: It aims to develop the market for Irish craft at home and abroad and to encourage excellence in Irish design and making
ga: Is iad na haidhmeanna atá acu ná margadh na gceardearraí Éireannacha a fhorbairt sa tír seo agus thar lear, agus an barrfheabhas a spreagadh sa dearadh agus sa déantúsaíocht Éireannach

source: CCoI runs craft-related training courses, provides information, mounts exhibitions and organises "Showcase", an annual trade fair held each January in the RDS in Dublin
ga: Reachtálann CCnÉ cúrsaí oiliúna sa cheardaíocht, cuireann siad eolas ar fáil, cuireann siad taispeántais suas agus eagraíonn siad "Showcase" aonach bliantúil ceardaíochta a reachtáltar gach Eanáir sa R.D.S. i mBaile Átha Cliath é
